Repository: common-repository/accessiblewp-skiplinks
Catalog: lang/accessiblewp-skiplinks-*.po
Languages: he_il

source: AccessibleWP - Skiplinks
he_il: ‫AccessibleWP - קישורי דילוג

source: Adds an accessible way to skip to page sections, as required by WCAG 2.0 for all levels.
he_il: מוסיף דרך נגישה לדלג בין המקטעים באתר שלך, כפי שנדרש על ידי WCAG 2.0 עבור כל הרמות.

source: Codenroll
he_il: קוד אנד רול

source: Navigate to
he_il: נווט/י אל

source: Skiplinks
he_il: קישורי דילוג

source: The skiplinks allow the user to skip between page sections. In order to define unique skiplinks to this specific page, you need to set the ID of the section and a label.
he_il: קישורי הדילוג מאפשרים למשתמש לדלג בין מקטעי העמוד. על מנת להגדיר קישורי דילוג ייחודיים לעמוד ספציפי זה, עליך להגדיר לכל מקטע את מזהה המקטע ותווית המתארת אותו.

source: For example:
he_il: לדוגמה:

source: Under "Section ID"
he_il: תחת ״מזהה המקטע״

source: Under "Skiplink Label"
he_il: תחת ״תווית הקישור״

source: Meet Our Team
he_il: הצוות שלנו

source: Section ID
he_il: מזהה המקטע

source: Skiplink Label
he_il: תווית הקישור

source: Drag this to reorder the skiplinks
he_il: ניתן לגרור רכיב זה כדי לסדר מחדש את קישורי הדילוג

source: Drag Icon
he_il: אייקון גרירה

source: Remove skiplink
he_il: הסרת קישור

source: Add another skiplink
he_il: הוספת קישור דילוג חדש

source: AccessibleWP Skiplinks
he_il: ‫AccessibleWP קישורי דילוג

source: Welcome to <span>AccessibleWP</span> Dashboard!
he_il: ברוכים הבאים אל לוח הבקרה של <span>AccessibleWP</span>!

source: Accessibility solutions for websites based on the WordPress.
he_il: פתרונות הנגשה לאתרים מבוססי וורדפרס.

source: Toolbar Settings
he_il: הגדרות סרגל נגישות

source: Who We Are?
he_il: מי אנחנו?

source: About The Author
he_il: אודות המפתח

source: W3C Accessibility Standards Overview
he_il: תקנות הנגישות

source: Send Feedback
he_il: שליחת משוב

source: Options
he_il: אפשרויות

source: Activate the skiplinks
he_il: הפעלת קישורי הדילוג

source: Turn sides over
he_il: הפוך את הצדדים

source: The default state of the skiplinks is that in LTR mode they appear on the left side and in RTL mode they appear on the right side. If you check this checkbox, the skiplinks will be displayed on opposite sides.
he_il: ברירת המחדל של קישורי הדילוג זה להופיע בצד ימין במצב RTL ובצד שמאל במצב LTR. כדי להפוך את הצדדים יש לסמן צ׳קבוקס זה.

source: Header link label
he_il: תווית הקישור עבור הכותרת העליונה

source: Header
he_il: כותרת עליונה

source: Set the label of your header link.
he_il: הגדרת התווית עבור הקישור אל הכותרת העליונה.

source: Header link ID
he_il: מזהה הכותרת העליונה

source: Set the ID of your header HTML tag in a CSS format. For example:
he_il: הגדרת ה-ID של הכותרת העליונה. למשל:

source: Content link label
he_il: תווית הקישור אל תחילת התוכן

source: Page Content
he_il: תוכן העמוד

source: Set the label of your content link.
he_il: הגדרת התווית של הקישור אל תחילת התוכן.

source: Content ID
he_il: מזהה תחילת התוכן

source: Set the ID of the HTML tag of your main content area in a CSS format. For example:
he_il: הגדרת ה-ID של תגית ה-HTML אשר פותחת את התוכן. לדוגמה:

source: Footer link label
he_il: תווית הקישור אל הכותרת התחתונה

source: Footer
he_il: כותרת תחתונה

source: Set the label of your footer link.
he_il: הגדרת התווית בקישור אל הכותרת התחתונה.

source: Footer ID
he_il: מזהה הכותרת התחתונה

source: Set the ID of your footer HTML tag in a CSS format. For example:
he_il: הגדרת ה-ID של תגית ה-HTML של הכותרת התחתונה. לדוגמה:

source: How To Use?
he_il: איך להשתמש?

source: This screen describes what the skiplinks are and how to use them.
he_il: מסך זה מתאר מהם קישורי הדילוג וכיצד להשתמש בהם.

source: What are skiplinks?
he_il: מהם קישורי דילוג?

source: Skiplinks allow the user to skip between the page sections using the keyboard (usually using the TAB key). These skiplinks are not visible in the interface but are accessible via the keyboard and appear on the screen only when they are in focus mode.
he_il: קישורי דילוג מאפשרים למשתמש לדלג בין חלקי העמוד באמצעות המקלדת (בדרך כלל באמצעות מקש TAB). קישורי דילוג אלו אינם גלויים בממשק אך נגישים דרך המקלדת ומופיעים על המסך רק כאשר הם במצב פוקוס.

source: How to use the skiplinks?
he_il: איך להשתמש בקישורי הדילוג?

source: To activate the skiplinks properly there are several steps that need to be done
he_il: כדי להפעיל את קישורי הדילוג כראוי יש כמה שלבים שצריך לעשות

source: First, activate the skiplinks to appear on the front-end by checking the checkbox on the "Options" screen next to the label: "Activate the skiplinks".
he_il: תחילה, יש להפעיל את קישורי הדילוג על ידי סימון הצ׳קבוקס במסך “אפשרויות” שלצד התווית: “הפעלת קישורי הדילוג”.

source: Now the permanent sections must be defined, those that appear on all your website pages (header, footer and page content). You can set this under the "Options" screen. Defining the skiplinks is done by setting the ID of that section and a very short description. For example if the ID of our header is 'header' we will define the ID of the section like this: <b>header</b> (without the # at the beginning), and in the label field we can write "Header".
he_il: כעת יש להגדיר את המקטעים הקבועים, אלו המופיעים בכל עמודי האתר שלך (כותרת עליונה, תחתונה ותחילת תוכן העמוד). ניתן להגדיר זאת תחת מסך “אפשרויות”. ההגדרה מתבצעת על ידי הזנת המזהה של אותו מקטע ותיאור קצר מאוד. למשל אם המזהה של הכותרת העליונה שלנו הוא ‘header’ נגדיר את המזהה של המקטע כך: <b>header</b> (ללא ה-# בהתחלה), ובשדה התווית נוכל לכתוב “ניווט ראשי” או ״כותרת עליונה״ (בהתאם למפרט הרכיב).

source: Once the permanent sections have been defined, it is possible to define more skiplinks for each page to its own unique sections. These skiplinks will only appear on that specific page. You can do this through the meta box found on each page edit in the same way we defined the permanent skiplinks (section ID and label).
he_il: לאחר הגדרת המקטעים הקבועים, ניתן להגדיר עוד קישורי דילוג ייחודיים לכל עמוד, שיופיעו רק בעמוד מסוים. ניתן לעשות זאת דרך תיבת המטא שנמצאת בכל עריכת עמוד באותו האופן שבו הגדרנו את הקישורים הקבועים (מזהה מקטע ותווית).

source: You can check the skiplinks you created by navigating the page using the TAB button on your keyboard.
he_il: ניתן לבדוק את קישורי הדילוג שיצרת על ידי ניווט בעמוד באמצעות לחצן ה-TAB שבמקלדת שלך.

source: Style
he_il: סגנון

source: Disable skiplinks animation
he_il: ביטול אנימציית הכניסה והיציאה

source: Disable skiplinks shadows
he_il: ביטול ההצללות

source: Custom background color
he_il: צבע רקע מותאם אישית

source: Custom text color
he_il: צבע טקסט מותאם אישית

source: Settings
he_il: הגדרות

source: My theme support 'wp_body_open' (recommended)
he_il: התבנית שלי תומכת בהוק ‘wp_body_open’ (<b>מומלץ</b>, עובד ברוב מערכות וורדפרס מגרסה 5.2 ומעלה)

source: Disable additional skiplinks from page meta
he_il: ביטול האפשרות להגדיר קישורי דילוג ייחודיים לכל עמוד בנפרד
